app/views/posts/index.html.erb

<% if !params[:author].blank? %>
  <% @posts = Post.by_author(:author.id)) %>
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')